soap_publish_message_ref.xml

<s:Envelope 
  xmlns:s="http://www.w3.org/2003/05/soap-envelope" 
  xmlns:a="http://www.w3.org/2005/08/addressing"
  xmlns:oh="urn:openhie.org:alerting"
  >
  <s:Header>
    <oh:IntendedRecipient>
      <oh:QueryTarget type="urn:ihe:iti:csd:2014:stored-function:facility-search">
        <csd:requestParams>
          <csd:codedType code="OPC" codingSchema="XXXXXX" />
          <csd:address>
            <csd:addressLine component="city">Chapel Hill</csd:addressLine>
          </csd:address>
        </csd:requestParams>
      </oh:QueryTarget>
      <oh:Target id='urn:ecid:1234'/>
    </oh:IntendedRecipient>
  </s:Header>
  <s:Body>
    <oh:Message 
	id='2c9597f0-4729-11e4-916c-0800200c9a77'
	published='2010-11-12T13:14:15Z'
	statusCode='Prioirity-Orange'  
	statusCodeScheme='CAPS-Example'	
	content-type='text/plan; charset=utf-8'
	xml:lang='en_US'
	src="http://emergencies.moh.gov.tk/alerts?id=2c9597f0-4729-11e4-916c-0800200c9a77"
	/>
    </oh:Message>    
  </s:Body>

</s:Envelope>
